# Most Polluted Countries - Limpieza de Datos

### · Antes de empezar...

1. Para gestionar los Dataframes:

In [2]:
#Para mi doc de Pipeline:
import suport as sp

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
from collections import Counter
from fuzzywuzzy import process, fuzz
import pickle

###  · Carga de CSVs

Empezamos cargando datos CSV procedentes de Kaggle con la información de los países y las ciudades más contaminadas desde 2017 hasta 2021.

In [43]:
cof17= pd.read_csv("datos/cof/costliving_2017.csv")
cof17.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              146.2
1           1  Switzerland              122.1
2           2      Iceland              111.7
3           3       Norway              106.3
4           4      Bahamas              104.0

In [44]:
cof17["Unnamed: 0"]

0        0
1        1
2        2
3        3
4        4
      ...
116    116
117    117
118    118
119    119
120    120
Name: Unnamed: 0, Length: 121, dtype: int64

In [54]:
col17= ["countries", "cost_living_index"]

In [55]:
cof17= cof17[col17]
cof17

       countries  cost_living_index
0        bermuda              146.2
1    switzerland              122.1
2        iceland              111.7
3         norway              106.3
4        bahamas              104.0
..           ...                ...
116      georgia               27.4
117     pakistan               27.2
118      ukraine               26.2
119        india               25.1
120        egypt               22.4

[121 rows x 2 columns]

In [47]:
def minusculas (x):
    x= [i.lower() for i in x]
    return(x)

In [48]:
cof17["countries"]= minusculas(cof17["countries"])

In [96]:
year=["2017"]

year17= year*len(cof17["countries"])

In [100]:
cof17["year"]= year17

cof17["year"]= pd.to_numeric(cof17["year"])

In [102]:
#control de información
#cof17.info()
#cof17

       countries  cost_living_index  year
0        bermuda              146.2  2017
1    switzerland              122.1  2017
2        iceland              111.7  2017
3         norway              106.3  2017
4        bahamas              104.0  2017
..           ...                ...   ...
116      georgia               27.4  2017
117     pakistan               27.2  2017
118      ukraine               26.2  2017
119        india               25.1  2017
120        egypt               22.4  2017

[121 rows x 3 columns]

Una vez limpio nuestro DataFrame de coste de vida referente al año 2017, procedemos a limpiar el resto de años:

#### 2018

In [103]:
cof18= pd.read_csv("datos/cof/costliving_2018.csv")
cof18.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              144.9
1           1  Switzerland              131.4
2           2      Iceland              124.0
3           3       Norway              113.7
4           4      Bahamas              100.7

In [104]:
col18= ["countries", "cost_living_index"]
cof18= cof18[col18]

In [105]:
cof18["countries"]= minusculas(cof18["countries"])

In [106]:
year=["2018"]

year18= year*len(cof18["countries"])

In [107]:
cof18["year"]= year18

cof18["year"]= pd.to_numeric(cof18["year"])

In [110]:
#Control de información
#cof18.info()
#cof18.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 115 entries, 0 to 114
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          115 non-null    object
 1   cost_living_index  115 non-null    float64
 2   year               115 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.8+ KB

     countries  cost_living_index  year
0      bermuda              144.9  2018
1  switzerland              131.4  2018
2      iceland              124.0  2018
3       norway              113.7  2018
4      bahamas              100.7  2018

#### 2019

In [111]:
cof19= pd.read_csv("datos/cof/costliving_2019.csv")
cof19.head(5)

   Unnamed: 0    countries  cost_living_index
0           0  Switzerland              121.2
1           1      Iceland              101.9
2           2       Norway              101.0
3           3      Bahamas               92.4
4           4   Luxembourg               86.1

In [112]:
col19= ["countries", "cost_living_index"]
cof19= cof19[col19]

In [113]:
cof19["countries"]= minusculas(cof19["countries"])

In [114]:
year=["2019"]

year19= year*len(cof19["countries"])

In [115]:
cof19["year"]= year19

cof19["year"]= pd.to_numeric(cof19["year"])

In [116]:
#Control de información
cof19.info()
cof19.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          119 non-null    object
 1   cost_living_index  119 non-null    float64
 2   year               119 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.9+ KB

     countries  cost_living_index  year
0  switzerland              121.2  2019
1      iceland              101.9  2019
2       norway              101.0  2019
3      bahamas               92.4  2019
4   luxembourg               86.1  2019

#### 2020

In [117]:
cof20= pd.read_csv("datos/cof/costliving_2019.csv")
cof20.head(5)

   Unnamed: 0    countries  cost_living_index
0           0  Switzerland              121.2
1           1      Iceland              101.9
2           2       Norway              101.0
3           3      Bahamas               92.4
4           4   Luxembourg               86.1

In [118]:
col20= ["countries", "cost_living_index"]
cof20= cof20[col20]

In [119]:
cof20["countries"]= minusculas(cof20["countries"])

In [120]:
year=["2020"]

year20= year*len(cof20["countries"])

In [124]:
cof20["year"]= year20

cof20["year"]= pd.to_numeric(cof20["year"])

In [125]:
#Control de información
cof20.info()
cof20.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          119 non-null    object
 1   cost_living_index  119 non-null    float64
 2   year               119 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.9+ KB

     countries  cost_living_index  year
0  switzerland              121.2  2020
1      iceland              101.9  2020
2       norway              101.0  2020
3      bahamas               92.4  2020
4   luxembourg               86.1  2020

#### 2021

In [123]:
cof21= pd.read_csv("datos/cof/costliving_2021.csv")
cof21.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              145.1
1           1  Switzerland              131.7
2           2       Norway              106.1
3           3      Iceland               96.8
4           4      Denmark               91.7

In [126]:
col21= ["countries", "cost_living_index"]
cof21= cof21[col21]

In [127]:
cof21["countries"]= minusculas(cof21["countries"])

In [128]:
year=["2021"]

year21= year*len(cof21["countries"])

In [129]:
cof21["year"]= year21

cof21["year"]= pd.to_numeric(cof21["year"])

In [130]:
#Control de información
cof21.info()
cof21.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 138 entries, 0 to 137
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          138 non-null    object
 1   cost_living_index  138 non-null    float64
 2   year               138 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.4+ KB

     countries  cost_living_index  year
0      bermuda              145.1  2021
1  switzerland              131.7  2021
2       norway              106.1  2021
3      iceland               96.8  2021
4      denmark               91.7  2021

In [131]:
costevida_total= pd.concat([cof17, cof18, cof19, cof20, cof21], axis=0, ignore_index = True)

In [132]:
costevida_total.to_csv('coste_vida_total.csv')